yelp_clone/app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Cafe Rouge"], ["created_at", "2016-02-29 17:24:02.394374"], ["updated_at", "2016-02-29 17:24:02.394374"]]
---
  def create
    @restaurant = Restaurant.create(restaurant_params)